YuzukiHD/TinyVision/kernel/linux-4.9/drivers/net/wireless/rtl8733bs/core/rtw_xmit.c
	if (max_bw > CHANNEL_WIDTH_40)
		max_bw = CHANNEL_WIDTH_40;

	for (bw = CHANNEL_WIDTH_20; bw <= max_bw; bw++) {
		/* RA may use lower rate for retry */
		if (rf_ctl->rate_bmp_ht_by_bw[bw] >= rate_bmp)
			bw_bmp |= ch_width_to_bw_cap(bw);
	}

exit:
	return bw_bmp;
}

u8 rtw_get_tx_bw_bmp_of_vht_rate(struct dvobj_priv *dvobj, u8 rate, u8 max_bw)
{
	struct rf_ctl_t *rf_ctl = dvobj_to_rfctl(dvobj);
	u8 bw;
	u8 bw_bmp = 0;
	u64 rate_bmp;

	if (!IS_VHT_RATE(rate)) {
		rtw_warn_on(1);
		goto exit;
	}

	rate_bmp = 1ULL << (rate - MGN_VHT1SS_MCS0);

	if (max_bw > CHANNEL_WIDTH_160)
		max_bw = CHANNEL_WIDTH_160;

	for (bw = CHANNEL_WIDTH_20; bw <= max_bw; bw++) {
		/* RA may use lower rate for retry */
		if (rf_ctl->rate_bmp_vht_by_bw[bw] >= rate_bmp)
			bw_bmp |= ch_width_to_bw_cap(bw);
	}

exit:
	return bw_bmp;
}

s16 rtw_adapter_get_oper_txpwr_max_mbm(_adapter *adapter)
{
	s16 mbm = -100 * MBM_PDBM;

	if (MLME_IS_ASOC(adapter)) {
		struct mlme_ext_priv *mlmeext = &adapter->mlmeextpriv;
		u8 ch = mlmeext->cur_channel;
		u8 bw = mlmeext->cur_bwmode;
		u8 offset = mlmeext->cur_ch_offset;
		u8 cch = rtw_get_center_ch(ch, bw, offset);
		u8 hw_rate = MRateToHwRate(mlmeext->tx_rate);
		u16 bmp_cck_ofdm_by_bw[1] = {0};
		u32 bmp_ht_by_bw[2] = {0};
		u64 bmp_vht_by_bw[4] = {0};
		u16 bmp_cck_ofdm = 0;
		u32 bmp_ht = 0;
		u64 bmp_vht = 0;
		int i;

		rtw_get_adapter_tx_rate_bmp(adapter, bmp_cck_ofdm_by_bw, bmp_ht_by_bw, bmp_vht_by_bw);

		bmp_cck_ofdm |= bmp_cck_ofdm_by_bw[0];
		for (i = 0; i < 2; i++)
			bmp_ht |= bmp_ht_by_bw[i];
		for (i = 0; i < 4; i++)
			bmp_vht |= bmp_vht_by_bw[i];

		if (IS_LEGACY_HRATE(hw_rate))
			bmp_cck_ofdm |= BIT(hw_rate);
		else if (IS_HT_HRATE(hw_rate))
			bmp_ht |= BIT(hw_rate - DESC_RATEMCS0);
		else if (IS_VHT_HRATE(hw_rate))
			bmp_vht |= BIT(hw_rate - DESC_RATEVHTSS1MCS0);

		mbm = phy_get_txpwr_total_max_mbm(adapter
			, bw, cch, ch, bmp_cck_ofdm, bmp_ht, bmp_vht);
	}

	return mbm;
}

s16 rtw_get_oper_txpwr_max_mbm(struct dvobj_priv *dvobj)
{
	struct rf_ctl_t *rfctl = dvobj_to_rfctl(dvobj);
	_adapter *adapter = dvobj_get_primary_adapter(dvobj);
	s16 mbm = -100 * MBM_PDBM;
	u8 ch, bw, offset;

	if (rtw_mi_get_ch_setting_union(adapter, &ch, &bw, &offset)) {
		u8 cch = rtw_get_center_ch(ch, bw, offset);
		u16 bmp_cck_ofdm = 0;
		u32 bmp_ht = 0;
		u64 bmp_vht = 0;
		int i;

		for (i = 0; i < dvobj->iface_nums; i++) {
			if (dvobj->padapters[i] && MLME_IS_ASOC(dvobj->padapters[i])) {
				struct mlme_ext_priv *mlmeext = &(dvobj->padapters[i]->mlmeextpriv);
				u8 hw_rate = MRateToHwRate(mlmeext->tx_rate);

				if (IS_LEGACY_HRATE(hw_rate))
					bmp_cck_ofdm |= BIT(hw_rate);
				else if (IS_HT_HRATE(hw_rate))
					bmp_ht |= BIT(hw_rate - DESC_RATEMCS0);
				else if (IS_VHT_HRATE(hw_rate))
					bmp_vht |= BIT(hw_rate - DESC_RATEVHTSS1MCS0);
			}
		}

		bmp_cck_ofdm |= rfctl->rate_bmp_cck_ofdm;
		for (i = 0; i < 2; i++)
			bmp_ht |= rfctl->rate_bmp_ht_by_bw[i];
		for (i = 0; i < 4; i++)
			bmp_vht |= rfctl->rate_bmp_vht_by_bw[i];

		mbm = phy_get_txpwr_total_max_mbm(adapter
			, bw, cch, ch, bmp_cck_ofdm, bmp_ht, bmp_vht);
	}

	return mbm;
}

u8 query_ra_short_GI(struct sta_info *psta, u8 bw)
{
	u8	sgi = _FALSE, sgi_20m = _FALSE, sgi_40m = _FALSE, sgi_80m = _FALSE;

#ifdef CONFIG_80211N_HT
#ifdef CONFIG_80211AC_VHT
	if (psta->vhtpriv.vht_option)
		sgi_80m = psta->vhtpriv.sgi_80m;
#endif
	sgi_20m = psta->htpriv.sgi_20m;
	sgi_40m = psta->htpriv.sgi_40m;
#endif

	switch (bw) {
	case CHANNEL_WIDTH_80:
		sgi = sgi_80m;
		break;
	case CHANNEL_WIDTH_40:
		sgi = sgi_40m;
		break;
	case CHANNEL_WIDTH_20:
	default:
		sgi = sgi_20m;
		break;
	}

	return sgi;
}

/* This function references driver insmond parameters to decide vcs mode. */
/* Driver insmond parameters: rtw_vrtl_carrier_sense and rtw_vcs_type */
static u8 validate_vcs(_adapter *padapter, u8  mode) {

	u8 vcs_mode = NONE_VCS;

	switch(padapter->registrypriv.vrtl_carrier_sense) {

		case DISABLE_VCS:
			vcs_mode = NONE_VCS;
			break;

		case ENABLE_VCS:
			vcs_mode = padapter->registrypriv.vcs_type;
			break;

		case AUTO_VCS:
			vcs_mode = mode;
			break;

		default:
			vcs_mode = NONE_VCS;
			break;
	}

	return vcs_mode;

}

static void update_attrib_vcs_info(_adapter *padapter, struct xmit_frame *pxmitframe)
{
	u32	sz;
	struct pkt_attrib	*pattrib = &pxmitframe->attrib;
	/* struct sta_info	*psta = pattrib->psta; */
	struct mlme_ext_priv	*pmlmeext = &(padapter->mlmeextpriv);
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);

	/*
		if(pattrib->psta)
		{
			psta = pattrib->psta;
		}
		else
		{
			RTW_INFO("%s, call rtw_get_stainfo()\n", __func__);
			psta=rtw_get_stainfo(&padapter->stapriv ,&pattrib->ra[0] );
		}

		if(psta==NULL)
		{
			RTW_INFO("%s, psta==NUL\n", __func__);
			return;
		}

		if(!(psta->state &WIFI_ASOC_STATE))
		{
			RTW_INFO("%s, psta->state(0x%x) != WIFI_ASOC_STATE\n", __func__, psta->state);
			return;
		}
	*/

	if (pattrib->nr_frags != 1)
		sz = padapter->xmitpriv.frag_len;
	else /* no frag */
		sz = pattrib->last_txcmdsz;

	/* (1) RTS_Threshold is compared to the MPDU, not MSDU. */
	/* (2) If there are more than one frag in  this MSDU, only the first frag uses protection frame. */
	/*		Other fragments are protected by previous fragment. */
	/*		So we only need to check the length of first fragment. */
	if (pmlmeext->cur_wireless_mode < WIRELESS_11_24N  || padapter->registrypriv.wifi_spec) {
		if (sz > padapter->registrypriv.rts_thresh)
			pattrib->vcs_mode = RTS_CTS;
		else {
			if (pattrib->rtsen)
				pattrib->vcs_mode = RTS_CTS;
			else if (pattrib->cts2self)
				pattrib->vcs_mode = CTS_TO_SELF;
			else
				pattrib->vcs_mode = NONE_VCS;
		}
	} else {
		while (_TRUE) {
#if 0 /* Todo */
			/* check IOT action */
			if (pHTInfo->IOTAction & HT_IOT_ACT_FORCED_CTS2SELF) {
				pattrib->vcs_mode = CTS_TO_SELF;
				pattrib->rts_rate = MGN_24M;
				break;
			} else if (pHTInfo->IOTAction & (HT_IOT_ACT_FORCED_RTS | HT_IOT_ACT_PURE_N_MODE)) {
				pattrib->vcs_mode = RTS_CTS;
				pattrib->rts_rate = MGN_24M;
				break;
			}
#endif

			/* IOT action */
			if ((pmlmeinfo->assoc_AP_vendor == HT_IOT_PEER_ATHEROS) && (pattrib->ampdu_en == _TRUE) &&
			    (padapter->securitypriv.dot11PrivacyAlgrthm == _AES_)) {
				pattrib->vcs_mode = CTS_TO_SELF;
				break;
			}


			/* check ERP protection */
			if (pattrib->rtsen || pattrib->cts2self) {
				if (pattrib->rtsen)
					pattrib->vcs_mode = RTS_CTS;
				else if (pattrib->cts2self)
					pattrib->vcs_mode = CTS_TO_SELF;

				break;
			}

			/* check HT op mode */
			if (pattrib->ht_en) {
				u8 HTOpMode = pmlmeinfo->HT_protection;
				if ((pmlmeext->cur_bwmode && (HTOpMode == 2 || HTOpMode == 3)) ||
				    (!pmlmeext->cur_bwmode && HTOpMode == 3)) {
					pattrib->vcs_mode = RTS_CTS;
					break;
				}
			}

			/* check rts */
			if (sz > padapter->registrypriv.rts_thresh) {
				pattrib->vcs_mode = RTS_CTS;
				break;
			}

